piyushk0309/stm32f401re-driver/Src/stm32f401re_usart_driver.c
/*
 * stm32f401re_usart_driver.c
 *
 *  Created on: 10-Jun-2026
 *      Author: TGT
 */


/* PERIPHERAL CLOCK SETUP*/
/*********************************************************************
 * @fn      		  - USART_PeriClockControl
 *
 * @brief             - This function enables or disables peripheral clock for the given USART port
 *
 * @param[in]         - base address of the USART peripheral
 * @param[in]         - ENABLE or DISABLE macros
 * @param[in]         -
 *
 * @return            -  none
 *
 * @Note              -  none

 */


#include "stm32f401xx.h"

static uint32_t RCC_GetPCLK1Value(void);
static uint32_t RCC_GetPCLK2Value(void);



void USART_PeriClockControl(USART_Reg_Def_t *pUSARTx,uint8_t EnorDi)
{
	if(EnorDi == ENABLE)
	{
		if(pUSARTx == USART1)
		{
			USART1_PCLK_EN();
		}
		else if(pUSARTx == USART2)
		{
			USART2_PCLK_EN();
		}
		else if(pUSARTx == USART6)
		{
			USART6_PCLK_EN();
		}

	}
	else
	{
		if(pUSARTx == USART1)
		{
			USART1_PCLK_DI();
		}
		else if(pUSARTx == USART2)
		{
			USART2_PCLK_DI();
		}
		else if(pUSARTx == USART6)
		{
			USART6_PCLK_DI();
		}

	}


}


/*********************************************************************
 * @fn      		  - USART_IRQConfig
 *
 * @brief             - interrupt request configuration of that USART port
 *
 * @param[in]         - irq number of that interrupt
 * @param[in]         - priority number of that interrupt
 * @param[in]         - enable or disable macros
 *
 * @return            -  none
 *
 * @Note              -  none

 */

void USART_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi)
{

	if(EnorDi == ENABLE)
	{
	if(IRQNumber <= 31)
	{
		//program iser0 register
		*NVIC_ISER0 |= (1 << IRQNumber);
	}
	else if (IRQNumber >31 && IRQNumber <64)
	{
		//program iser1 register
		*NVIC_ISER1 |= (1 << (IRQNumber%32));

	}
	else if(IRQNumber >= 64 && IRQNumber < 96)
	{
		//program iser2 register
		*NVIC_ISER2 |= (1 << (IRQNumber%64));
	}
	}

	else
	{

		if(IRQNumber <= 31)
			{
				//program icer0 register
			*NVIC_ICER0 |= (1 << IRQNumber);

			}
			else if (IRQNumber >31 && IRQNumber <64)
			{
				//program icer1 register
				*NVIC_ICER1 |= (1 << (IRQNumber%32));
			}
			else if(IRQNumber >= 64 && IRQNumber < 96)
			{
				//program icer2 register
				*NVIC_ICER2 |= (1 << (IRQNumber%64));
			}

	}

}


//usart peripheral control api

void USART_PeripheralControl(USART_Reg_Def_t *pUSARTx, uint8_t EnOrDi)
{
	if(EnOrDi==ENABLE)
	{
		pUSARTx->CR1 |= 1<<13;
	}
	else
	{
		pUSARTx->CR1 &= ~(1<<13);

	}
}

void  USART_IRQPriorityConfig(uint8_t IRQNumber,uint32_t Priority )
{
	// first lets find out priority register
	uint8_t iprx = IRQNumber/4;
	uint8_t iprx_section = IRQNumber %4;

	*(NVIC_PR_BASE_ADDR +(iprx)) |= (Priority << (8*iprx_section+4)); // FOR ARM CROTEX M4 ONLY AS LOWER 4 BITS ARE NOT APPLICABLE


}


//usart init and dinit apis





void USART_DeInit(USART_Reg_Def_t *pUSARTx)
{

			if(pUSARTx == USART1)
			{
				USART1_REG_RESET();
			}
			else if(pUSARTx == USART2)
			{
				USART2_REG_RESET();
			}
			else if(pUSARTx == USART6)
			{
				USART6_REG_RESET();
			}



}


/*********************************************************************
 * @fn      		  - USART_Init
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              -

 */
void USART_Init(USART_Handle_t *pUSARTHandle)
{

	//Temporary variable
	uint32_t tempreg=0;

/******************************** Configuration of CR1******************************************/

	//Implement the code to enable the Clock for given USART peripheral
	USART_PeriClockControl(pUSARTHandle->pUSARTx,ENABLE);

	//Enable USART Tx and Rx engines according to the USART_Mode configuration item
	if ( pUSARTHandle->USART_Config.Mode == USART_MODE_ONLY_RX)
	{
		//Implement the code to enable the Receiver bit field
		tempreg|= (1 << 2);
	}else if (pUSARTHandle->USART_Config.Mode == USART_MODE_ONLY_TX)
	{
		//Implement the code to enable the Transmitter bit field
		tempreg |= ( 1 << 3 );

	}else if (pUSARTHandle->USART_Config.Mode == USART_MODE_TXRX)
	{
		//Implement the code to enable the both Transmitter and Receiver bit fields
		tempreg |= ( ( 1 << 2) | ( 1 << 3) );
	}

    //Implement the code to configure the Word length configuration item
	tempreg |= pUSARTHandle->USART_Config.WordLength << 12 ;


    //Configuration of parity control bit fields
	if ( pUSARTHandle->USART_Config.ParityControl == USART_PARITY_EN_EVEN)
	{
		//Implement the code to enale the parity control
		tempreg |= ( 1 << 10);

		//Implement the code to enable EVEN parity
		//Not required because by default EVEN parity will be selected once you enable the parity control

	}else if (pUSARTHandle->USART_Config.ParityControl == USART_PARITY_EN_ODD )
	{
		//Implement the code to enable the parity control
	    tempreg |= ( 1 << 10);

	    //Implement the code to enable ODD parity
	    tempreg |= ( 1 << 9);

	}

   //Program the CR1 register
	pUSARTHandle->pUSARTx->CR1 = tempreg;

/******************************** Configuration of CR2******************************************/

	tempreg=0;

	//Implement the code to configure the number of stop bits inserted during USART frame transmission
	tempreg |= pUSARTHandle->USART_Config.USART_NoOfStopBits << 12;

	//Program the CR2 register
	pUSARTHandle->pUSARTx->CR2 = tempreg;

/******************************** Configuration of CR3******************************************/

	tempreg=0;

	//Configuration of USART hardware flow control
	if ( pUSARTHandle->USART_Config.HWFlowControl == USART_HW_FLOW_CTRL_CTS)
	{
		//Implement the code to enable CTS flow control
		tempreg |= ( 1 << 9);


	}else if (pUSARTHandle->USART_Config.HWFlowControl == USART_HW_FLOW_CTRL_RTS)
	{
		//Implement the code to enable RTS flow control
		tempreg |= (1<<8);

	}else if (pUSARTHandle->USART_Config.HWFlowControl == USART_HW_FLOW_CTRL_CTS_RTS)
	{
		//Implement the code to enable both CTS and RTS Flow control
		tempreg |= (1<<8);
		tempreg |= (1<<9);

	}


	pUSARTHandle->pUSARTx->CR3 = tempreg;
}




	/*********************************************************************
	 * @fn      		  - USART_SendData
	 *
	 * @brief             -
	 *
	 * @param[in]         -
	 * @param[in]         -
	 * @param[in]         -
	 *
	 * @return            -
	 *
	 * @Note              - Resolve all the TODOs

	 */
	void USART_SendData(USART_Handle_t *pUSARTHandle, uint8_t *pTxBuffer, uint32_t Len)
	{

		uint16_t *pdata;
	   //Loop over until "Len" number of bytes are transferred
		for(uint32_t i = 0 ; i < Len; i++)
		{
			//Implement the code to wait until TXE flag is set in the SR
			while(!(pUSARTHandle->pUSARTx->SR&(1<<7)));

	         //Check the USART_WordLength item for 9BIT or 8BIT in a frame
			if(pUSARTHandle->USART_Config.WordLength == USART_WORDLEN_9BITS)
			{
				//if 9BIT, load the DR with 2bytes masking the bits other than first 9 bits
				pdata = (uint16_t*) pTxBuffer;
				pUSARTHandle->pUSARTx->DR = (*pdata & (uint16_t)0x01FF);

				//check for USART_ParityControl
				if(pUSARTHandle->USART_Config.ParityControl == USART_PARITY_DISABLE)
				{
					//No parity is used in this transfer. so, 9bits of user data will be sent
					//Implement the code to increment pTxBuffer twice
					pTxBuffer++;
					pTxBuffer++;
				}
				else
				{
					//Parity bit is used in this transfer . so , 8bits of user data will be sent
					//The 9th bit will be replaced by parity bit by the hardware
					pTxBuffer++;
				}
			}
			else
			{
				//This is 8bit data transfer
				pUSARTHandle->pUSARTx->DR = (*pTxBuffer  & (uint8_t)0xFF);

				//Implement the code to increment the buffer address
				pTxBuffer++;
			}

		}

		//Implement the code to wait till TC flag is set in the SR
		while( !(pUSARTHandle->pUSARTx->SR&(1<<6)));
	}


	/*********************************************************************
	 * @fn      		  - USART_ReceiveData
	 *
	 * @brief             -
	 *
	 * @param[in]         -
	 * @param[in]         -
	 * @param[in]         -
	 *
	 * @return            -
	 *
	 * @Note              -

	 */

	void USART_ReceiveData(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len)
	{
	   //Loop over until "Len" number of bytes are transferred
		for(uint32_t i = 0 ; i < Len; i++)
		{
			//Implement the code to wait until RXNE flag is set in the SR
			while(!(pUSARTHandle->pUSARTx->SR&(1<<5)));

			//Check the USART_WordLength to decide whether we are going to receive 9bit of data in a frame or 8 bit
			if(pUSARTHandle->USART_Config.WordLength == USART_WORDLEN_9BITS)
			{
				//We are going to receive 9bit data in a frame

				//check are we using USART_ParityControl control or not
				if(pUSARTHandle->USART_Config.ParityControl == USART_PARITY_DISABLE )
				{
					//No parity is used. so, all 9bits will be of user data

					//read only first 9 bits. so, mask the DR with 0x01FF
					*((uint16_t*) pRxBuffer) = (pUSARTHandle->pUSARTx->DR  & (uint16_t)0x1FF);

					//Now increment the pRxBuffer two times
					pRxBuffer++;
					pRxBuffer++;
				}
				else
				{
					//Parity is used, so, 8bits will be of user data and 1 bit is parity
					 *pRxBuffer = (pUSARTHandle->pUSARTx->DR  & (uint8_t)0xFF);

					 //Increment the pRxBuffer
					 pRxBuffer++;
				}
			}
			else
			{
				//We are going to receive 8bit data in a frame

				//check are we using USART_ParityControl control or not
				if(pUSARTHandle->USART_Config.ParityControl == USART_PARITY_DISABLE)
				{
					//No parity is used , so all 8bits will be of user data

					//read 8 bits from DR
					 *pRxBuffer = pUSARTHandle->pUSARTx->DR;
				}

				else
				{
					//Parity is used, so , 7 bits will be of user data and 1 bit is parity

					//read only 7 bits , hence mask the DR with 0X7F
					 *pRxBuffer = (uint8_t) pUSARTHandle->pUSARTx->DR&(0x7F);

				}

				//increment the pRxBuffer
				pRxBuffer++;
			}
		}

	}

	/*********************************************************************
	 * @fn      		  - USART_SendDataWithIT
	 *
	 * @brief             -
	 *
	 * @param[in]         -
	 * @param[in]         -
	 * @param[in]         -
	 *
	 * @return            -
	 *
	 * @Note              -

	 */
	uint8_t USART_SendDataIT(USART_Handle_t *pUSARTHandle,uint8_t *pTxBuffer, uint32_t Len)
	{
		uint8_t txstate = pUSARTHandle->usart_busy;

		if(txstate != USART_BUSY_IN_TX)
		{
			pUSARTHandle->TxLen = Len;
			pUSARTHandle->pTxBuffer = pTxBuffer;
			pUSARTHandle->TXBusyState = USART_BUSY_IN_TX;

			//Implement the code to enable interrupt for TXE
			pUSARTHandle->pUSARTx->CR1  |= 1<<7;


			//Implement the code to enable interrupt for TC
			pUSARTHandle->pUSARTx->CR1  |= 1<<6;



		}

		return txstate;

	}


	/*********************************************************************
	 * @fn      		  - USART_ReceiveDataIT
	 *
	 * @brief             -
	 *
	 * @param[in]         -
	 * @param[in]         -
	 * @param[in]         -
	 *
	 * @return            -
	 *
	 * @Note              - Resolve all the TODOs

	 */
	uint8_t USART_ReceiveDataIT(USART_Handle_t *pUSARTHandle,uint8_t *pRxBuffer, uint32_t Len)
	{
		uint8_t rxstate = pUSARTHandle->usart_busy;

		if(rxstate != USART_BUSY_IN_RX)
		{
			pUSARTHandle->RxLen = Len;
			pUSARTHandle->pRxBuffer = pRxBuffer;
			pUSARTHandle->RXBusyState = USART_BUSY_IN_RX;

			//Implement the code to enable interrupt for RXNE
			pUSARTHandle->pUSARTx->CR1  |= 1<<5;


		}

		return rxstate;

	}



/******************************** Configuration of BRR(Baudrate register)******************************************/

	//Implement the code to configure the baud rate
	//We will cover this in the lecture. No action required here

	/*********************************************************************
	 * @fn      		  - USART_SetBaudRate
	 *
	 * @brief             -
	 *
	 * @param[in]         -
	 * @param[in]         -
	 * @param[in]         -
	 *
	 * @return            -
	 *
	 * @Note              -  Resolve all the TODOs

	 */
	void USART_SetBaudRate(USART_Reg_Def_t *pUSARTx, uint32_t BaudRate)
	{

		//Variable to hold the APB clock
		uint32_t PCLKx;

		uint32_t usartdiv;

		//variables to hold Mantissa and Fraction values
		uint32_t M_part,F_part;

	  uint32_t tempreg=0;

	  //Get the value of APB bus clock in to the variable PCLKx
	  if(pUSARTx == USART1 || pUSARTx == USART6)
	  {
		   //USART1 and USART6 are hanging on APB2 bus
		   PCLKx = RCC_GetPCLK2Value();
	  }else
	  {
		   PCLKx = RCC_GetPCLK1Value();
	  }

	  //Check for OVER8 configuration bit
	  if(pUSARTx->CR1 & (1 << 15))
	  {
		   //OVER8 = 1 , over sampling by 8
		   usartdiv = ((25 * PCLKx) / (2 *BaudRate));
	  }else
	  {
		   //over sampling by 16
		   usartdiv = ((25 * PCLKx) / (4 *BaudRate));

	  }

	  //Calculate the Mantissa part
	  M_part = usartdiv/100;

	  //Place the Mantissa part in appropriate bit position . refer USART_BRR
	  tempreg |= M_part << 4;

	  //Extract the fraction part
	  F_part = (usartdiv - (M_part * 100));

	  //Calculate the final fractional
	  if(pUSARTx->CR1 & ( 1 << 15))
	   {
		  //OVER8 = 1 , over sampling by 8
		  F_part = ((( F_part * 8)+ 50) / 100)& ((uint8_t)0x07);

	   }else
	   {
		   //over sampling by 16
		   F_part = ((( F_part * 8)+ 50) / 100) & ((uint8_t)0x0F);

	   }

	  //Place the fractional part in appropriate bit position . refer USART_BRR
	  tempreg |= F_part;

	  //copy the value of tempreg in to BRR register
	  pUSARTx->BRR = tempreg;
	}


static uint16_t AHB_PreScaler[8] = {2,4,8,16,64,128,256,512};
static uint16_t APB_PreScaler[4] = {2,4,8,16};

static uint32_t RCC_GetPCLK1Value(void)
	{
		uint32_t pclk,SystemClk;
		uint8_t clksrc,temp,apb1p;
		uint16_t ahbp;
		clksrc = (RCC->CFGR>>2)&0x3;

		if(clksrc == 0)
		{
			SystemClk = 16000000;
		}

		temp = (RCC->CFGR>>4)&0xF;

		if(temp<8)
		{
			ahbp =1;
		}
		else
		{
			ahbp = AHB_PreScaler[temp-8];
		}

		temp = (RCC->CFGR>>10)&0x7;

		if(temp<4)
		{
			apb1p =1;
		}
		else
		{
			apb1p = APB_PreScaler[temp-4];
		}

		pclk = SystemClk/(ahbp*apb1p);

		return pclk;


	}

static uint32_t RCC_GetPCLK2Value(void)
	{
		uint32_t pclk,SystemClk;
		uint8_t clksrc,temp,apb2p;
		uint16_t ahbp;
		clksrc = (RCC->CFGR>>2)&0x3;

		if(clksrc == 0)
		{
			SystemClk = 16000000;
		}

		temp = (RCC->CFGR>>4)&0xF;

		if(temp<8)
		{
			ahbp =1;
		}
		else
		{
			ahbp = AHB_PreScaler[temp-8];
		}

		temp = (RCC->CFGR>>13)&0x7;

		if(temp<4)
		{
			apb2p =1;
		}
		else
		{
			apb2p = APB_PreScaler[temp-4];
		}

		pclk = SystemClk/(ahbp*apb2p);

		return pclk;


	}

/*********************************************************************
 * @fn      		  - USART_IRQHandler
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              -

 */
void USART_IRQHandling(USART_Handle_t *pUSARTHandle)
{

	uint32_t temp1 , temp2;

/*************************Check for TC flag ********************************************/

    //Implement the code to check the state of TC bit in the SR
	temp1 = pUSARTHandle->pUSARTx->SR & ( 1 << 6);

	 //Implement the code to check the state of TCEIE bit
	temp2 = pUSARTHandle->pUSARTx->CR1 & ( 1 << 6);

	if(temp1 && temp2 )
	{
		//this interrupt is because of TC

		//close transmission and call application callback if TxLen is zero
		if ( pUSARTHandle->TXBusyState == USART_BUSY_IN_TX)
		{
			//Check the TxLen . If it is zero then close the data transmission
			if(!( pUSARTHandle->TxLen))
			{
				//Implement the code to clear the TC flag
				pUSARTHandle->pUSARTx->SR &= ~( 1 << 6);

				//Implement the code to clear the TCIE control bit
				pUSARTHandle->pUSARTx->CR1 &= ~( 1 << 6);

				//Reset the application state
				pUSARTHandle->TXBusyState = USART_READY;

				//Reset Buffer address to NULL
				pUSARTHandle->pTxBuffer = NULL;

				//Reset the length to zero
				pUSARTHandle->TxLen =0;

				//Call the applicaton call back with event USART_EVENT_TX_CMPLT
				USART_ApplicationEventCallback(pUSARTHandle,USART_EVENT_TX_CMPLT);
			}
		}
	}

/*************************Check for TXE flag ********************************************/

	//Implement the code to check the state of TXE bit in the SR
	temp1 = pUSARTHandle->pUSARTx->SR & ( 1 << 7);

	//Implement the code to check the state of TXEIE bit in CR1
	temp2 = pUSARTHandle->pUSARTx->CR1 & ( 1 << 7);


	if(temp1 && temp2 )
	{
		//this interrupt is because of TXE

		if(pUSARTHandle->TXBusyState == USART_BUSY_IN_TX)
		{
			//Keep sending data until Txlen reaches to zero
			if(pUSARTHandle->TxLen > 0)
			{
				//Check the USART_WordLength item for 9BIT or 8BIT in a frame
				if(pUSARTHandle->USART_Config.WordLength == USART_WORDLEN_9BITS)
				{

					//loading only first 9 bits , so we have to mask with the value 0x01FF
					pUSARTHandle->pUSARTx->DR = (*( pUSARTHandle->pTxBuffer) & (uint16_t)0x01FF);

					//check for USART_ParityControl
					if(pUSARTHandle->USART_Config.ParityControl == USART_PARITY_DISABLE)
					{
						//No parity is used in this transfer , so, 9bits of user data will be sent
						//Implement the code to increment pTxBuffer twice
						pUSARTHandle->pTxBuffer++;
						pUSARTHandle->pTxBuffer++;


						//Implement the code to decrement the length
						pUSARTHandle->TxLen--;
					}
					else
					{
						//Parity bit is used in this transfer . so , 8bits of user data will be sent
						//The 9th bit will be replaced by parity bit by the hardware
						pUSARTHandle->pTxBuffer++;


						//Implement the code to decrement the length
						pUSARTHandle->TxLen--;

					}
				}
				else
				{
					//This is 8bit data transfer
					pUSARTHandle->pUSARTx->DR = (*(pUSARTHandle->pTxBuffer)  & (uint8_t)0xFF);

					//Implement the code to increment the buffer address
					pUSARTHandle->pTxBuffer++;

					//Implement the code to decrement the length
					pUSARTHandle->TxLen--;

				}

			}
			if (pUSARTHandle->TxLen == 0 )
			{
				//TxLen is zero
				//Implement the code to clear the TXEIE bit (disable interrupt for TXE flag )
				pUSARTHandle->pUSARTx->CR1 &=  ~( 1 << 7);
			}
		}
	}

/*************************Check for RXNE flag ********************************************/

	temp1 = pUSARTHandle->pUSARTx->SR & ( 1 << 5);
	temp2 = pUSARTHandle->pUSARTx->CR1 & ( 1 << 5);


	if(temp1 && temp2 )
	{
		//this interrupt is because of rxne
		//this interrupt is because of txe
		if(pUSARTHandle->RXBusyState == USART_BUSY_IN_RX)
		{
			//TXE is set so send data
			if(pUSARTHandle->RxLen > 0)
			{
				//Check the USART_WordLength to decide whether we are going to receive 9bit of data in a frame or 8 bit
				if(pUSARTHandle->USART_Config.WordLength == USART_WORDLEN_9BITS)
				{
					//We are going to receive 9bit data in a frame

					//Now, check are we using USART_ParityControl control or not
					if(pUSARTHandle->USART_Config.ParityControl == USART_PARITY_DISABLE)
					{
						//No parity is used. so, all 9bits will be of user data

						//read only first 9 bits so mask the DR with 0x01FF
						*((uint16_t*) pUSARTHandle->pRxBuffer) = (pUSARTHandle->pUSARTx->DR  & (uint16_t)0x01FF);

						//Now increment the pRxBuffer two times
						pUSARTHandle->pRxBuffer++;
						pUSARTHandle->pRxBuffer++;

						//Implement the code to decrement the length
						pUSARTHandle->RxLen--;
					}
					else
					{
						//Parity is used. so, 8bits will be of user data and 1 bit is parity
						 *(pUSARTHandle->pRxBuffer) = (pUSARTHandle->pUSARTx->DR  & (uint8_t)0xFF);

						 //Now increment the pRxBuffer
						pUSARTHandle->pRxBuffer++;


						 //Implement the code to decrement the length
						pUSARTHandle->RxLen--;
					}
				}
				else
				{
					//We are going to receive 8bit data in a frame

					//Now, check are we using USART_ParityControl control or not
					if(pUSARTHandle->USART_Config.ParityControl == USART_PARITY_DISABLE)
					{
						//No parity is used , so all 8bits will be of user data

						//read 8 bits from DR
						 *(pUSARTHandle->pRxBuffer) = (uint8_t) (pUSARTHandle->pUSARTx->DR  & (uint8_t)0xFF);
					}

					else
					{
						//Parity is used, so , 7 bits will be of user data and 1 bit is parity

						//read only 7 bits , hence mask the DR with 0X7F
						*(pUSARTHandle->pRxBuffer) = (uint8_t) (pUSARTHandle->pUSARTx->DR  & (uint8_t)0x7F);

					}

					//Now , increment the pRxBuffer
					pUSARTHandle->pRxBuffer++;

					//Implement the code to decrement the length
					pUSARTHandle->RxLen--;
				}


			}//if of >0

			if(! pUSARTHandle->RxLen)
			{
				//disable the rxne
				pUSARTHandle->pUSARTx->CR1 &= ~( 1 << 5);
				pUSARTHandle->RXBusyState = USART_READY;
				USART_ApplicationEventCallback(pUSARTHandle,USART_EVENT_RX_CMPLT);
			}
		}
	}




/*************************Check for IDLE detection flag ********************************************/

	//Implement the code to check the status of IDLE flag bit in the SR
	temp1 = pUSARTHandle->pUSARTx->SR &(1<<4);

	//Implement the code to check the state of IDLEIE bit in CR1
	temp2 = pUSARTHandle->pUSARTx->CR3 & ( 1 << 4);


	if(temp1 && temp2)
	{
		//Implement the code to clear the IDLE flag. Refer to the RM to understand the clear sequence
		temp1 &= ~(pUSARTHandle->pUSARTx->SR &(1<<4));

		//this interrupt is because of idle
		USART_ApplicationEventCallback(pUSARTHandle,USART_EVENT_IDLE);
	}

/*************************Check for Overrun detection flag ********************************************/

	//Implement the code to check the status of ORE flag  in the SR
	temp1 = pUSARTHandle->pUSARTx->SR & (1<<3);

	//Implement the code to check the status of RXNEIE  bit in the CR1
	temp2 = pUSARTHandle->pUSARTx->CR1 & (1<<5);


	if(temp1  && temp2 )
	{
		//Need not to clear the ORE flag here, instead give an api for the application to clear the ORE flag .

		//this interrupt is because of Overrun error
		USART_ApplicationEventCallback(pUSARTHandle,USART_ERR_ORE);
	}


}

